
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 3 to change, 3 to destroy.</code></pre>

* Create
  * module.shared_vault.azurerm_key_vault_access_policy.developer[0]
  * module.shared_vault.azurerm_key_vault_access_policy.managed_identity_access_policy[&#34;a1b6213f-9492-4199-989b-0701059976df&#34;]
  * module.shared_vault.azurerm_monitor_diagnostic_setting.kv-ds
* Update
  * azurerm_key_vault_secret.storageaccount_id
  * azurerm_resource_group.shared_rg
  * module.shared_vault.azurerm_key_vault.kv
* Delete
  * module.shared_vault.azurerm_key_vault_access_policy.managed_identity_access_policy
* Replace
  * module.shared_vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.storage_account.azurerm_storage_account.storage_account


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.storageaccount_id will be updated in-place
  ~ resource "azurerm_key_vault_secret" "storageaccount_id" {
        id                      = "https://dm-aat.vault.azure.net/secrets/storage-account-id/04d92f21ee7445e78040dc88eab5de9b"
        key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dm-shared-aat/providers/Microsoft.KeyVault/vaults/dm-aat"
        name                    = "storage-account-id"
        resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dm-shared-aat/providers/Microsoft.KeyVault/vaults/dm-aat/secrets/storage-account-id/versions/04d92f21ee7445e78040dc88eab5de9b"
        resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dm-shared-aat/providers/Microsoft.KeyVault/vaults/dm-aat/secrets/storage-account-id"
        tags                    = {}
      ~ value                   = (sensitive value)
        version                 = "04d92f21ee7445e78040dc88eab5de9b"
        versionless_id          = "https://dm-aat.vault.azure.net/secrets/storage-account-id"

        timeouts {}
    }

  # azurerm_resource_group.shared_rg will be updated in-place
  ~ resource "azurerm_resource_group" "shared_rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dm-shared-aat"
        location = "uksouth"
        name     = "dm-shared-aat"
      ~ tags     = {
            "BuiltFrom"           = "https://github.com/HMCTS/dm-shared-infrastructure.git"
          - "Destroy Me"          = "No" -> null
          - "Team Contact"        = "#ccd-devops" -> null
          - "Team Name"           = "Evidence Management" -> null
          + "application"         = "evidence-management"
          + "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#em-dev-chat"
          ~ "environment"         = "aat" -> "staging"
          + "managedBy"           = "Evidence Management"
        }

        timeouts {}
    }

  # module.shared_vault.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        access_policy                   = [
            {
                application_id          = ""
                certificate_permissions = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "ManageContacts",
                    "ManageIssuers",
                    "GetIssuers",
                    "ListIssuers",
                    "SetIssuers",
                    "DeleteIssuers",
                    "Purge",
                ]
                key_permissions         = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "Decrypt",
                    "Encrypt",
                    "UnwrapKey",
                    "WrapKey",
                    "Verify",
                    "Sign",
                    "Purge",
                    "Rotate",
                    "GetRotationPolicy",
                    "SetRotationPolicy",
                ]
                object_id               = "14684706-744a-4810-9b38-e89ef5f901b0"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "Purge",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            {
                application_id          = ""
                certificate_permissions = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "ManageContacts",
                    "ManageIssuers",
                    "GetIssuers",
                    "ListIssuers",
                    "SetIssuers",
                    "DeleteIssuers",
                    "Purge",
                ]
                key_permissions         = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "Decrypt",
                    "Encrypt",
                    "UnwrapKey",
                    "WrapKey",
                    "Verify",
                    "Sign",
                    "Purge",
                    "Rotate",
                    "GetRotationPolicy",
                    "SetRotationPolicy",
                ]
                object_id               = "83570b4a-8765-4826-a713-011e5cc787c1"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "Purge",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            {
                application_id          = ""
                certificate_permissions = []
                key_permissions         = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                ]
                object_id               = "d23f6b2b-4547-4f5c-801c-c6c55eb3fdee"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            {
                application_id          = ""
                certificate_permissions = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "ManageContacts",
                    "ManageIssuers",
                    "GetIssuers",
                    "ListIssuers",
                    "SetIssuers",
                    "DeleteIssuers",
                ]
                key_permissions         = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                ]
                object_id               = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            {
                application_id          = ""
                certificate_permissions = []
                key_permissions         = []
                object_id               = "0e6b530c-57aa-4fa3-8352-bad1dfe05884"
                secret_permissions      = [
                    "Get",
                    "List",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            {
                application_id          = ""
                certificate_permissions = []
                key_permissions         = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                ]
                object_id               = "4d48f4bc-cd88-42c7-935e-0670c9ad6a02"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            {
                application_id          = ""
                certificate_permissions = []
                key_permissions         = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                ]
                object_id               = "926fa20d-1f1f-4055-b228-9069e0117d16"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            {
                application_id          = ""
                certificate_permissions = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "ManageContacts",
                    "ManageIssuers",
                    "GetIssuers",
                    "ListIssuers",
                    "SetIssuers",
                    "DeleteIssuers",
                    "Purge",
                ]
                key_permissions         = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                ]
                object_id               = "3140a1c8-aa61-41dc-a699-cc2db8bbd9db"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            {
                application_id          = ""
                certificate_permissions = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "ManageContacts",
                    "ManageIssuers",
                    "GetIssuers",
                    "ListIssuers",
                    "SetIssuers",
                    "DeleteIssuers",
                ]
                key_permissions         = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                ]
                object_id               = "515e1dd3-2fb4-4c2f-8322-cd3470b8ccfa"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            {
                application_id          = ""
                certificate_permissions = []
                key_permissions         = []
                object_id               = "3c97d706-ec28-4041-95b1-0743bd29a663"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            {
                application_id          = ""
                certificate_permissions = []
                key_permissions         = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                ]
                object_id               = "a82de354-859a-47ff-941c-5bf62202822f"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            {
                application_id          = ""
                certificate_permissions = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "ManageContacts",
                    "ManageIssuers",
                    "GetIssuers",
                    "ListIssuers",
                    "SetIssuers",
                    "DeleteIssuers",
                ]
                key_permissions         = [
                    "Get",
                    "List",
                ]
                object_id               = "f4a487a8-cf1b-4d2c-819b-6fa1d69734ae"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            {
                application_id          = ""
                certificate_permissions = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "ManageContacts",
                    "ManageIssuers",
                    "GetIssuers",
                    "ListIssuers",
                    "SetIssuers",
                    "DeleteIssuers",
                ]
                key_permissions         = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                ]
                object_id               = "d0c32eaa-f190-4b8e-9884-adefce62b143"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            {
                application_id          = ""
                certificate_permissions = []
                key_permissions         = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                ]
                object_id               = "384cf106-88a0-4872-8ad0-2cf381996111"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            {
                application_id          = ""
                certificate_permissions = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "ManageContacts",
                    "ManageIssuers",
                    "GetIssuers",
                    "ListIssuers",
                    "SetIssuers",
                    "DeleteIssuers",
                ]
                key_permissions         = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "Decrypt",
                    "Encrypt",
                    "UnwrapKey",
                    "WrapKey",
                    "Verify",
                    "Sign",
                    "Purge",
                ]
                object_id               = "b0a04d38-608b-4710-909a-3b712ad0d85e"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            {
                application_id          = ""
                certificate_permissions = []
                key_permissions         = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "Decrypt",
                    "Encrypt",
                    "UnwrapKey",
                    "WrapKey",
                    "Verify",
                    "Sign",
                    "Purge",
                ]
                object_id               = "370c7c92-c3e3-4d3f-9c64-94b06053affa"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "Purge",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            {
                application_id          = ""
                certificate_permissions = []
                key_permissions         = []
                object_id               = "0498eca1-7aa4-434e-b004-347d4a211880"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "Purge",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            {
                application_id          = ""
                certificate_permissions = [
                    "Create",
                    "Delete",
                    "DeleteIssuers",
                    "Get",
                    "GetIssuers",
                    "Import",
                ]
                key_permissions         = [
                    "Backup",
                    "Create",
                    "Decrypt",
                    "Delete",
                    "Encrypt",
                    "Get",
                    "Import",
                    "List",
                    "Purge",
                    "Recover",
                    "Restore",
                    "Sign",
                    "UnwrapKey",
                    "Update",
                    "Verify",
                    "WrapKey",
                ]
                object_id               = "c3e37198-67bb-4262-9d5c-ec480163c75c"
                secret_permissions      = [
                    "Backup",
                    "Delete",
                    "Get",
                    "List",
                    "Purge",
                    "Recover",
                    "Restore",
                    "Set",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            {
                application_id          = ""
                certificate_permissions = [
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "ManageContacts",
                    "ManageIssuers",
                    "GetIssuers",
                    "ListIssuers",
                    "SetIssuers",
                    "DeleteIssuers",
                ]
                key_permissions         = [
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                ]
                object_id               = "be8b3850-998a-4a66-8578-da268b8abd6b"
                secret_permissions      = [
                    "List",
                    "Set",
                    "Delete",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            {
                application_id          = ""
                certificate_permissions = []
                key_permissions         = []
                object_id               = "4116a9ce-1a7f-4f03-ab46-a52162351189"
                secret_permissions      = [
                    "List",
                    "Get",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            {
                application_id          = ""
                certificate_permissions = [
                    "Get",
                    "List",
                ]
                key_permissions         = [
                    "Get",
                    "List",
                ]
                object_id               = "34712054-69f7-40b9-a417-4a5f5cf5397a"
                secret_permissions      = [
                    "Get",
                    "List",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            {
                application_id          = ""
                certificate_permissions = [
                    "Create",
                    "Delete",
                    "DeleteIssuers",
                    "Get",
                    "GetIssuers",
                    "Import",
                ]
                key_permissions         = [
                    "Backup",
                    "Create",
                    "Decrypt",
                    "Delete",
                    "Encrypt",
                    "Get",
                    "Import",
                    "List",
                    "Purge",
                    "Recover",
                    "Restore",
                    "Sign",
                    "UnwrapKey",
                    "Update",
                    "Verify",
                    "WrapKey",
                ]
                object_id               = "85ac3c5a-779b-4267-9d29-2da689082680"
                secret_permissions      = [
                    "Backup",
                    "Delete",
                    "Get",
                    "List",
                    "Purge",
                    "Recover",
                    "Restore",
                    "Set",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            {
                application_id          = ""
                certificate_permissions = [
                    "Create",
                    "Delete",
                    "DeleteIssuers",
                    "Get",
                    "GetIssuers",
                    "Import",
                ]
                key_permissions         = [
                    "Backup",
                    "Create",
                    "Decrypt",
                    "Delete",
                    "Encrypt",
                    "Get",
                    "Import",
                    "List",
                    "Purge",
                    "Recover",
                    "Restore",
                    "Sign",
                    "UnwrapKey",
                    "Update",
                    "Verify",
                    "WrapKey",
                ]
                object_id               = "c12b6257-1c4b-47a7-bb78-cc6edb9df68f"
                secret_permissions      = [
                    "Backup",
                    "Delete",
                    "Get",
                    "List",
                    "Purge",
                    "Recover",
                    "Restore",
                    "Set",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            {
                application_id          = ""
                certificate_permissions = [
                    "Get",
                    "List",
                ]
                key_permissions         = [
                    "Get",
                    "List",
                ]
                object_id               = "a1b6213f-9492-4199-989b-0701059976df"
                secret_permissions      = [
                    "Get",
                    "List",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            {
                application_id          = ""
                certificate_permissions = []
                key_permissions         = []
                object_id               = "9829ebcc-55e4-4402-b2bc-5f0c1596e9d0"
                secret_permissions      = [
                    "Backup",
                    "Delete",
                    "Get",
                    "List",
                    "Purge",
                    "Recover",
                    "Restore",
                    "Set",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            {
                application_id          = ""
                certificate_permissions = [
                    "Create",
                    "Delete",
                    "DeleteIssuers",
                    "Get",
                    "GetIssuers",
                    "Import",
                ]
                key_permissions         = [
                    "Backup",
                    "Create",
                    "Decrypt",
                    "Delete",
                    "Encrypt",
                    "Get",
                    "Import",
                    "List",
                    "Purge",
                    "Recover",
                    "Restore",
                    "Sign",
                    "UnwrapKey",
                    "Update",
                    "Verify",
                    "WrapKey",
                ]
                object_id               = "e2ad93bc-4655-4801-8100-8ed155b0698c"
                secret_permissions      = [
                    "Backup",
                    "Delete",
                    "Get",
                    "List",
                    "Purge",
                    "Recover",
                    "Restore",
                    "Set",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            {
                application_id          = ""
                certificate_permissions = [
                    "Create",
                    "Delete",
                    "DeleteIssuers",
                    "Get",
                    "GetIssuers",
                    "Import",
                    "List",
                    "Update",
                    "Recover",
                    "Backup",
                    "Restore",
                    "ManageContacts",
                    "ManageIssuers",
                    "ListIssuers",
                    "SetIssuers",
                ]
                key_permissions         = [
                    "Backup",
                    "Create",
                    "Decrypt",
                    "Delete",
                    "Encrypt",
                    "Get",
                    "Import",
                    "List",
                    "Purge",
                    "Recover",
                    "Restore",
                    "Sign",
                    "UnwrapKey",
                    "Update",
                    "Verify",
                    "WrapKey",
                ]
                object_id               = "ca6d5085-485a-417d-8480-c3cefa29df31"
                secret_permissions      = [
                    "Backup",
                    "Delete",
                    "Get",
                    "List",
                    "Purge",
                    "Recover",
                    "Restore",
                    "Set",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            {
                application_id          = ""
                certificate_permissions = [
                    "Create",
                    "Delete",
                    "DeleteIssuers",
                    "Get",
                    "GetIssuers",
                    "Import",
                ]
                key_permissions         = [
                    "Backup",
                    "Create",
                    "Decrypt",
                    "Delete",
                    "Encrypt",
                    "Get",
                    "Import",
                    "List",
                    "Purge",
                    "Recover",
                    "Restore",
                    "Sign",
                    "UnwrapKey",
                    "Update",
                    "Verify",
                    "WrapKey",
                ]
                object_id               = "f31a5e37-2045-4760-becb-db46e8a36973"
                secret_permissions      = [
                    "Backup",
                    "Delete",
                    "Get",
                    "List",
                    "Purge",
                    "Recover",
                    "Restore",
                    "Set",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            {
                application_id          = ""
                certificate_permissions = []
                key_permissions         = []
                object_id               = "683f6d34-5b0d-4ffe-a964-877f1d82b916"
                secret_permissions      = [
                    "List",
                    "Get",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
        ]
        enable_rbac_authorization       = false
        enabled_for_deployment          = true
        enabled_for_disk_encryption     = true
        enabled_for_template_deployment = true
        id                              = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dm-shared-aat/providers/Microsoft.KeyVault/vaults/dm-aat"
        location                        = "uksouth"
        name                            = "dm-aat"
        public_network_access_enabled   = true
      ~ purge_protection_enabled        = false -> true
        resource_group_name             = "dm-shared-aat"
        sku_name                        = "standard"
        soft_delete_retention_days      = 90
      ~ tags                            = {
            "BuiltFrom"           = "https://github.com/HMCTS/dm-shared-infrastructure.git"
          - "Destroy Me"          = "No" -> null
          - "Team Contact"        = "#ccd-devops" -> null
          - "Team Name"           = "Evidence Management" -> null
          + "application"         = "evidence-management"
          + "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#em-dev-chat"
          ~ "environment"         = "aat" -> "staging"
          + "managedBy"           = "Evidence Management"
        }
        tenant_id                       = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
        vault_uri                       = "https://dm-aat.vault.azure.net/"

        network_acls {
            bypass                     = "AzureServices"
            default_action             = "Allow"
            ip_rules                   = []
            virtual_network_subnet_ids = []
        }
    }

  # module.shared_vault.azurerm_key_vault_access_policy.creator_access_policy must be replaced
-/+ resource "azurerm_key_vault_access_policy" "creator_access_policy" {
      ~ certificate_permissions = [
            "Create",
            "Delete",
            "DeleteIssuers",
            "Get",
            "GetIssuers",
            "Import",
          + "List",
          + "ListIssuers",
          + "SetIssuers",
          + "Update",
          + "ManageContacts",
          + "ManageIssuers",
        ]
      ~ id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dm-shared-aat/providers/Microsoft.KeyVault/vaults/dm-aat/objectId/c3e37198-67bb-4262-9d5c-ec480163c75c" -> (known after apply)
      ~ key_permissions         = [
          - "Backup",
            "Create",
          - "Decrypt",
          - "Delete",
          - "Encrypt",
          + "List",
            "Get",
          + "Delete",
          + "Update",
            "Import",
          - "List",
          - "Purge",
          - "Recover",
          + "Backup",
            "Restore",
          - "Sign",
          + "Decrypt",
          + "Encrypt",
            "UnwrapKey",
          - "Update",
          - "Verify",
            "WrapKey",
          + "Sign",
          + "Verify",
        ]
        key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dm-shared-aat/providers/Microsoft.KeyVault/vaults/dm-aat"
      ~ object_id               = "c3e37198-67bb-4262-9d5c-ec480163c75c" -> "ca6d5085-485a-417d-8480-c3cefa29df31"
      ~ secret_permissions      = [
          - "Backup",
          - "Delete",
          - "Get",
          + "Set",
            "List",
          - "Purge",
          + "Get",
          + "Delete",
            "Recover",
          - "Restore",
          - "Set",
          + "Purge",
        ]
      - storage_permissions     = [] -> null
        tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"

      - timeouts {}
    }

  # module.shared_vault.azurerm_key_vault_access_policy.developer[0] will be created
  + resource "azurerm_key_vault_access_policy" "developer" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dm-shared-aat/providers/Microsoft.KeyVault/vaults/dm-aat"
      + object_id               = "b2a1773c-a5ae-48b5-b5fa-95b0e05eee05"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.shared_vault.azurerm_key_vault_access_policy.managed_identity_access_policy will be destroyed
  - resource "azurerm_key_vault_access_policy" "managed_identity_access_policy" {
      - certificate_permissions = [
          - "Get",
          - "List",
        ] -> null
      - id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dm-shared-aat/providers/Microsoft.KeyVault/vaults/dm-aat/objectId/a1b6213f-9492-4199-989b-0701059976df" -> null
      - key_permissions         = [
          - "Get",
          - "List",
        ] -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dm-shared-aat/providers/Microsoft.KeyVault/vaults/dm-aat" -> null
      - object_id               = "a1b6213f-9492-4199-989b-0701059976df" -> null
      - secret_permissions      = [
          - "Get",
          - "List",
        ] -> null
      - storage_permissions     = [] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null

      - timeouts {}
    }

  # module.shared_vault.azurerm_key_vault_access_policy.managed_identity_access_policy["a1b6213f-9492-4199-989b-0701059976df"] will be created
  + resource "azurerm_key_vault_access_policy" "managed_identity_access_policy" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dm-shared-aat/providers/Microsoft.KeyVault/vaults/dm-aat"
      + object_id               = "a1b6213f-9492-4199-989b-0701059976df"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.shared_vault.azurerm_monitor_diagnostic_setting.kv-ds will be created
  + resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
      + name                       = "dm-aat"
      + target_resource_id         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dm-shared-aat/providers/Microsoft.KeyVault/vaults/dm-aat"

      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
    }

  # module.storage_account.azurerm_storage_account.storage_account must be replaced
-/+ resource "azurerm_storage_account" "storage_account" {
        access_tier                       = "Hot"
        account_kind                      = "StorageV2"
      ~ account_replication_type          = "ZRS" -> "LRS"
        account_tier                      = "Standard"
      ~ allow_nested_items_to_be_public   = true -> false
      + cross_tenant_replication_enabled  = true
        default_to_oauth_authentication   = false
        enable_https_traffic_only         = true
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/dm-shared-aat/providers/Microsoft.Storage/storageAccounts/dmsharedaat" -> (known after apply)
        infrastructure_encryption_enabled = false
        is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
        location                          = "uksouth"
      ~ min_tls_version                   = "TLS1_0" -> "TLS1_2"
        name                              = "dmsharedaat"
        nfsv3_enabled                     = false
      ~ primary_access_key                = (sensitive value)
      ~ primary_blob_connection_string    = (sensitive value)
      ~ primary_blob_endpoint             = "https://dmsharedaat.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                 = "dmsharedaat.blob.core.windows.net" -> (known after apply)
      ~ primary_connection_string         = (sensitive value)
      ~ primary_dfs_endpoint              = "https://dmsharedaat.dfs.core.windows.net/" -> (known after apply)
      ~ primary_dfs_host                  = "dmsharedaat.dfs.core.windows.net" -> (known after apply)
      ~ primary_file_endpoint             = "https://dmsharedaat.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                 = "dmsharedaat.file.core.windows.net" -> (known after apply)
      ~ primary_location                  = "uksouth" -> (known after apply)
      ~ primary_queue_endpoint            = "https://dmsharedaat.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host                = "dmsharedaat.queue.core.windows.net" -> (known after apply)
      ~ primary_table_endpoint            = "https://dmsharedaat.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host                = "dmsharedaat.table.core.windows.net" -> (known after apply)
      ~ primary_web_endpoint              = "https://dmsharedaat.z33.web.core.windows.net/" -> (known after apply)
      ~ primary_web_host                  = "dmsharedaat.z33.web.core.windows.net" -> (known after apply)
        queue_encryption_key_type         = "Service"
        resource_group_name               = "dm-shared-aat"
      ~ secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      ~ secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
        shared_access_key_enabled         = true
        table_encryption_key_type         = "Service"
      ~ tags                              = {
            "BuiltFrom"              = "https://github.com/HMCTS/dm-shared-infrastructure.git"
            "Deployment Environment" = "aat"
            "Destroy Me"             = "No"
            "Team Contact"           = "#ccd-devops"
          - "Team Name"              = "Evidence Management" -> null
          + "application"            = "evidence-management"
          + "businessArea"           = "CFT"
            "changeUrl"              = ""
            "contactSlackChannel"    = "#em-dev-chat"
          ~ "environment"            = "aat" -> "staging"
          + "managedBy"              = "Evidence Management"
        }

      ~ blob_properties {
          ~ change_feed_enabled           = false -> (known after apply)
          ~ change_feed_retention_in_days = 0 -> (known after apply)
          + default_service_version       = (known after apply)
          ~ last_access_time_enabled      = false -> (known after apply)
          ~ versioning_enabled            = false -> (known after apply)

          + container_delete_retention_policy {
              + days = (known after apply)
            }

          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      ~ network_rules {
            bypass                     = [
                "AzureServices",
            ]
            default_action             = "Deny"
          ~ ip_rules                   = [] -> (known after apply)
          ~ virtual_network_subnet_ids = [
                "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/core-infra-subnet-3-aat",
                "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/aks-infra-aat-rg/providers/Microsoft.Network/virtualNetworks/core-aat-vnet/subnets/aks-00",
                "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/aks-infra-aat-rg/providers/Microsoft.Network/virtualNetworks/core-aat-vnet/subnets/aks-01",
              - "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/aks-00",
              - "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/aks-01",
            ]
        }

      ~ queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          ~ hour_metrics {
              ~ enabled               = true -> (known after apply)
              ~ include_apis          = true -> (known after apply)
              ~ retention_policy_days = 31 -> (known after apply)
              ~ version               = "1.0" -> (known after apply)
            }

          ~ logging {
              ~ delete                = true -> (known after apply)
              ~ read                  = true -> (known after apply)
              ~ retention_policy_days = 31 -> (known after apply)
              ~ version               = "1.0" -> (known after apply)
              ~ write                 = true -> (known after apply)
            }

          ~ minute_metrics {
              ~ enabled               = true -> (known after apply)
              ~ include_apis          = true -> (known after apply)
              ~ retention_policy_days = 5 -> (known after apply)
              ~ version               = "1.0" -> (known after apply)
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      ~ share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + retention_policy {
              + days = (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + versions                        = (known after apply)
            }
        }
    }

Plan: 5 to add, 3 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":19,"Program":"tfcmt","SHA1":"","Vars":{}} -->